In [10]:
import pandas as pd

In [11]:
data = pd.read_csv('./queries/test.csv')
data

   applicant_id                                         experience
0             1  Data Scientist with 5 years experience in pyth...
1             2  Software engineer skilled in Java web developm...

In [28]:
data_td = data.T
data_td.to_csv('./queries/data.csv')

In [33]:
f = data_td.T
f

  applicant_id                                         experience
0            1  Data Scientist with 5 years experience in pyth...
1            2  Software engineer skilled in Java web developm...

In [41]:
f.to_json('./queries/skills/input_data.json')

In [39]:
g = f.drop(['applicant_id'], axis=1)
g.to_json('./queries/skills/input_data.json')

In [40]:
g

                                          experience
0  Data Scientist with 5 years experience in pyth...
1  Software engineer skilled in Java web developm...

In [30]:
file = "./queries/data.csv"
with open(file) as my_file:
    readpd = pd.read_csv(file).T

readpd

                       0                                                  1
Unnamed: 0  applicant_id                                         experience
0                      1  Data Scientist with 5 years experience in pyth...
1                      2  Software engineer skilled in Java web developm...